# IsAttachedToStructure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationRodInfo..::..IsAttachedToStructure Property
FabricationRodInfo Class See Also
---
Checks if the hanger is attached to structure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsAttachedToStructure { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsAttachedToStructure As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsAttachedToStructure {
	bool get ();
}
```

# See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace